old-work/new-old-work/test-lambda-final.yml
# # test-lambda-final.yml
# config:
#   target: "https://m6ks5oetmg.execute-api.us-east-1.amazonaws.com"
#   processor: "./lambda-logger-with-responses.js"
#   phases:
#     - name: test-phase
#       duration: 1
#       arrivalRate: 2
#       # arrivalCount: 2
#       # arrivalRate: 50
#       # arrivalCount: 50
      
#     # Then uncomment this for 50 requests
#     # - name: load-test
#     #   duration: 10
#     #   arrivalCount: 50

# scenarios:
#   - name: "lambda-claude-test"
#     flow:
#       - post:
#           url: "/staging/invoke-claude"
#           afterResponse: "logRequest"
#           json:
#             question: "Why do some people qualify for Medicaid and others for Medicare?"
#             evaluationPrompt: |
#               You are an expert insurance evaluator. A user has answered the question: "Why do some people qualify for Medicaid and others for Medicare?"
              
#               Your task: Evaluate their answer using ONLY the facts provided below. Respond in exactly 3 sentences.
              
#               EVALUATION RULES:
#               - If correct: Confirm accuracy and briefly reinforce the key distinction
#               - If incorrect: State why it's wrong and provide the correct explanation
#               - Use only the provided facts - no outside knowledge
              
#               FACTS:
#               - Medicare: Federal program for people 65+ OR under 65 with qualifying disabilities
#               - Medicaid: State-managed program for people meeting income thresholds OR having qualifying disabilities
#               - Key difference: Medicare eligibility = age (65+) or disability; Medicaid eligibility = income level and/or disability
#               - Both programs can use private insurers for additional coverage
              
#               USER'S ANSWER: Medicaid is for old people. Medicare is for young people.
              
#               Your evaluation:
#             userAnswer: "Medicaid is for old people. Medicare is for young people."



# config:
#   target: "https://postman-echo.com"
#   processor: "./lambda-logger-with-responses.js"
#   phases:
#     - name: test-phase
#       duration: 1
#       arrivalRate: 10
#       # arrivalCount: 2
#       # arrivalRate: 50
#       # arrivalCount: 50
# scenarios:
#   - name: postman-echo
#     flow:
#       - post:
#           url: "/post"
#           json:
#             anything: "goes"


config:
  target: "https://cmry23cc45k5zvxtxbvbspysky0qglri.lambda-url.us-east-1.on.aws" # "https://m6ks5oetmg.execute-api.us-east-1.amazonaws.com"
  processor: "./logs-singlefile.js"
  phases:
    - name: test-phase
      duration: 1
      arrivalRate: 2

scenarios:
  - name: "lambda-claude-test"
    flow:
      - post:
          url: "/invoke-claude" # "/staging/invoke-claude"
          beforeRequest: "markStart"   # <— added
          afterResponse: "logRequest"  # <— stays, but points to new processor
          json:
            question: "Why do some people qualify for Medicaid and others for Medicare?"
            evaluationPrompt: |
              You are an expert insurance evaluator. A user has answered the question: "Why do some people qualify for Medicaid and others for Medicare?"
              Your task: Evaluate their answer using ONLY the facts provided below. Respond in exactly 3 sentences.
              EVALUATION RULES:
              - If correct: Confirm accuracy and briefly reinforce the key distinction
              - If incorrect: State why it's wrong and provide the correct explanation
              - Use only the provided facts - no outside knowledge
              FACTS:
              - Medicare: Federal program for people 65+ OR under 65 with qualifying disabilities
              - Medicaid: State-managed program for people meeting income thresholds OR having qualifying disabilities
              - Key difference: Medicare eligibility = age (65+) or disability; Medicaid eligibility = income level and/or disability
              - Both programs can use private insurers for additional coverage
              USER'S ANSWER: Medicaid is for old people. Medicare is for young people.
              Your evaluation:
            userAnswer: "Medicaid is for old people. Medicare is for young people."